jmeter-loader-skills/assets/templates/jdbc_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="JDBC数据库压测模板" enabled="true">
      <stringProp name="TestPlan.comments">JDBC数据库压测模板 - 包含连接池配置、查询/插入/更新操作及结果断言

参数说明:
- concurrency: 并发用户数 (默认: 10)
- rampup: Ramp-up时间(秒) (默认: 10)
- duration: 压测持续时间(秒) (默认: 60)
- jdbc_pool_name: 连接池名称 (默认: myDatabase)
- jdbc_pool_max: 连接池最大连接数 (默认: 10)
- jdbc_timeout: 连接超时时间(毫秒) (默认: 10000)
- db_host: 数据库主机地址 (默认: localhost)
- db_port: 数据库端口 (默认: 3306)
- db_name: 数据库名称 (默认: testdb)
- db_username: 数据库用户名 (默认: root)
- db_password: 数据库密码 (默认: 空)
- jdbc_driver: JDBC驱动类名 (默认: com.mysql.cj.jdbc.Driver)
- select_query: 查询SQL语句 (默认: SELECT id, name, email FROM users LIMIT 10)
- insert_name: 插入数据-名称 (默认: test)
- insert_value: 插入数据-值 (默认: 1)
- update_name: 更新条件-名称 (默认: test)
- update_value: 更新数据-值 (默认: 2)
- think_time: 思考时间(毫秒) (默认: 0)
- result_file: 结果文件路径 (默认: result.jtl)
</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TG_JDBC_LoadTest" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(concurrency,10)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,10)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,60)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="DataSourcePanelGui" testclass="JDBCDataSource" testname="JDBC_Connection_Config" enabled="true">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="checkQuery">SELECT 1</stringProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">${__P(jdbc_pool_name,myDatabase)}</stringProp>
          <stringProp name="dbUrl">jdbc:mysql://${__P(db_host,localhost)}:${__P(db_port,3306)}/${__P(db_name,testdb)}?useUnicode=true&amp;characterEncoding=utf8&amp;useSSL=false</stringProp>
          <stringProp name="driver">${__P(jdbc_driver,com.mysql.cj.jdbc.Driver)}</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">${__P(db_password,)}</stringProp>
          <stringProp name="poolMax">${__P(jdbc_pool_max,10)}</stringProp>
          <stringProp name="timeout">${__P(jdbc_timeout,10000)}</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="username">${__P(db_username,root)}</stringProp>
        </JDBCDataSource>
        <hashTree/>
        <JDBCSampler guiclass="JDBCTestElementGui" testclass="JDBCSampler" testname="JDBC_Select" enabled="true">
          <stringProp name="dataSource">${__P(jdbc_pool_name,myDatabase)}</stringProp>
          <stringProp name="query">${__P(select_query,SELECT id, name, email FROM users LIMIT 10)}</stringProp>
          <stringProp name="queryType">Select Statement</stringProp>
          <stringProp name="variableNames">id,name,email</stringProp>
        </JDBCSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="RA_Select_Success" enabled="true">
            <collectionProp name="Asserter.testStrings">
              <elementProp name="" elementType="string">
                <stringProp name="Argument.value">200</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">JDBC查询执行失败</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <JDBCSampler guiclass="JDBCTestElementGui" testclass="JDBCSampler" testname="JDBC_Insert" enabled="true">
          <stringProp name="dataSource">${__P(jdbc_pool_name,myDatabase)}</stringProp>
          <stringProp name="query">INSERT INTO test_data (name, value, created_at) VALUES (?, ?, NOW())</stringProp>
          <stringProp name="queryType">Prepared Update Statement</stringProp>
          <stringProp name="queryArguments">${__P(insert_name,test)},${__P(insert_value,1)}</stringProp>
          <stringProp name="queryArgumentsTypes">VARCHAR,INTEGER</stringProp>
        </JDBCSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="RA_Insert_Success" enabled="true">
            <collectionProp name="Asserter.testStrings">
              <elementProp name="" elementType="string">
                <stringProp name="Argument.value">200</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">JDBC插入执行失败</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <JDBCSampler guiclass="JDBCTestElementGui" testclass="JDBCSampler" testname="JDBC_Update" enabled="true">
          <stringProp name="dataSource">${__P(jdbc_pool_name,myDatabase)}</stringProp>
          <stringProp name="query">UPDATE test_data SET value = ? WHERE name = ?</stringProp>
          <stringProp name="queryType">Prepared Update Statement</stringProp>
          <stringProp name="queryArguments">${__P(update_value,2)},${__P(update_name,test)}</stringProp>
          <stringProp name="queryArgumentsTypes">INTEGER,VARCHAR</stringProp>
        </JDBCSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="RA_Update_Success" enabled="true">
            <collectionProp name="Asserter.testStrings">
              <elementProp name="" elementType="string">
                <stringProp name="Argument.value">200</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">JDBC更新执行失败</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <GaussianRandomTimer guiclass="GaussianRandomTimerGui" testclass="GaussianRandomTimer" testname="TM_ThinkTime" enabled="true">
          <stringProp name="ConstantTimer.delay">${__P(think_time,0)}</stringProp>
          <stringProp name="RandomTimer.range">100</stringProp>
        </GaussianRandomTimer>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="查看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">${__P(result_file,result.jtl)}</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>